In [2]:
import numpy as np
import pandas as pd

In [4]:
df1 = pd.DataFrame(np.random.randint(1, 10, size=(2, 2)),
                  columns=list('ab'),
                  index=list('xy'))
df2 = pd.DataFrame(np.random.randint(1, 10, size=(2,2)),
                  columns=list('ab'),
                  index=list('zt'))

In [6]:
df1

   a  b
x  3  1
y  6  5

In [8]:
df2

   a  b
z  2  2
t  7  1

In [14]:
pd.concat([df1, df2], axis=0)

   a  b
x  3  1
y  6  5
z  2  2
t  7  1

In [18]:
df3 = pd.DataFrame({'personnel': ['Bob', 'Lisa', 'Sue'],
                    'groupe': ['SAF', 'R&D', 'RH']})

df4 = pd.DataFrame(
    {
        'personnel': ['Lisa', 'Bob', 'Sue'],
        'date embauche': [2004, 2008, 2014]
    }
)

In [26]:
df3

  personnel groupe
0       Bob    SAF
1      Lisa    R&D
2       Sue     RH

In [28]:
df4

  personnel  date embauche
0      Lisa           2004
1       Bob           2008
2       Sue           2014

In [30]:
pd.merge(df3, df4)

  personnel groupe  date embauche
0       Bob    SAF           2008
1      Lisa    R&D           2004
2       Sue     RH           2014